Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: perlfunc - Perl builtin functions
es_es: perlfunc - Funciones integradas en Perl

source: The exact semantics and interface of TYPE and ATTRS are still evolving.
es_es: La semántica exacta e interfaz de TIPO y ATRIBUTOS están aún en evolución.

source: How about this:
es_es: ¿Qué le parece esto?

source: In Perl 5.14, all characters whose code points are above 127 are not quoted in UTF8-encoded strings, but all are quoted in UTF-8 strings.
es_es: En Perl 5.14, todos los caracteres cuyo código de punto esté por encima de 127 no son escapados como strings codificados en UTF-8, sino que todos son escapados en strings UTF-8.

source: The C<continue> block, if any, is not executed:
es_es: El bloque C<continue>, si está, no es ejecutado:

source: C<B> upgraded to version 1.09_01
es_es: C<B> actualizado a la versión 1.09_01

source: perl592delta Perl changes in version 5.9.2
es_es: perl592delta Cambios en la versión 5.9.2

source: At any rate, the first field should be "uts".
es_es: En cualquier caso, el primer campo debe ser "uts".

source: The main use of typeglobs in modern Perl is create symbol table aliases.
es_es: El uso principal de los typeglobs en el Perl moderno es crear alias en la tabla de símbolos.

source: Returns the cosine of EXPR (expressed in radians).
es_es: Devuelve el coseno de EXPR (expresado en radianes).

source: In a Unicode encoding, multiple subsequent bytes can be used to store a single code point, or simply: character.
es_es: En una codificación de Unicode se pueden utilizar varios bytes seguidos para almacenar un solo código de carácter (o carácter).

source: If you do just C<< open(A, ">>&B") >>, the filehandle A will not have the same file descriptor as B, and therefore flock(A) will not flock(B) nor vice versa.
es_es: Si hace sólo C<< open(A, ">>&B") >>, el identificador de archivo A no tendrá el mismo descriptor de archivo que B, y por lo tanto flock(A) no hará un flock(B), y viceversa.

source: a/b is 9/44
es_es: a/b es 9/44

source: =head2 C-style Logical Or X<||> X<operator, logical, or>
es_es: =head2 Or lógico al estilo del C X<||> X<operator, logical, or> X<operador, lógico, or>

source: The maximum depth is compiled into perl, so changing it requires a custom build.
es_es: La profundidad máxima está compilada en perl, por lo que su modificación requiere una generación personalizada.

source: It can be used interactively or imperatively.
es_es: Se puede usar de manera interactiva o imperativa.

source: See the F<h2ph> documentation for more on how to convert a whole bunch of header files at once.
es_es: Consulte la documentación de F<h2ph> para obtener más información sobre la manera de convertir varios archivos de encabezado a la vez.

# printf "bits are %0*v8b ", " ", $bits; # random bitstring
source: printf "bits are %0*v8b\n", " ", $bits; # random bitstring
es_es: printf "bits son %0*v8b\n", " ", $bits; # cadena de bits aleatoria

source: While Perl programmers are encouraged to use the Perl-specific syntax, the following are also accepted:
es_es: Mientras que se anima a los programadores de Perl a usar la sintaxis específica de Perl, lo siguiente también es aceptado:

source: Returns the current position I<in bytes> for FILEHANDLE, or -1 on error.
es_es: Devuelve la posición actual I<en bytes> para IDENTIFICADOR_ARCHIVO, o -1 en caso de error.

source: by Mark-Jason Dominus
es_es: Mark-Jason Dominus

source: eval "tr/$oldlist/$newlist/, 1" or die $@;
es_es: eval "tr/$viejalista/$nuevalista/, 1" or die $@;

source: It's a good idea to run this on a pod file you've patched.
es_es: Tras aplicar una revisión a un archivo pod, es recomendable ejecutar este programa.

source: The header files living in the Byte File System (you could put the there if you want); 2.
es_es: Los archivos cabecera residen en el I<Byte File System > (puede ponerla ahí si quiere); 2.

source: Those functions all have return values, so use them.
es_es: Todas estas funciones tienen valores de retorno, así que úselos.

source: See pod/perlbook.pod for more information.
es_es: Vea pod/perlbook.pod para más información.

source: If you want to use Perl on the Hurd, I recommend using the Debian GNU/Hurd distribution ( see http://www.debian.org/ ), even if an official, stable release has not yet been made.
es_es: Si desea usar Perl en Hurd, la distribución recomendada es Debian GNU/Hurd (visite http://www.debian.org/ ), aunque aún no existe una versión oficial estable.

source: Sunfreeware.com: Solaris 2.5 to Solaris 10 (SPARC and x86)
es_es: Sunfreeware.com: Solaris 2.5 a Solaris 10 (SPARC y x86)

source: A common abuse of this power stems from the ability to make infinite loops using regular expressions, with something as innocuous as:
es_es: Un abuso común de este poder se deriva de la capacidad de hacer bucles infinitos mediante expresiones regulares, con algo tan inocuo como:

source: =item given EXPR BLOCK X<given>
es_es: =item given EXPR BLOQUE X<given>

source: Modules which can be released on cpan are known as "dual-life" modules.
es_es: Los módulos que se pueden publicar en CPAN se denominan módulos de «evolución dual».

source: =item readdir DIRHANDLE X<readdir>
es_es: =item readdir IDENTIFICADOR_DIR X<readdir>

source: 3 new characters added to the ISO-8859-7 encoding
es_es: 3 nuevos caracteres añadidos en la codificación ISO-8859-7

source: L<Unicode::UCD/num()> can be used to sort this out.
es_es: L<Unicode::UCD/num()> se puede utilizar para resolver esto.

source: Generalized quotes.
es_es: Comillas generales.

source: See the examples in L<perlipc/"Sockets: Client/Server Communication">.
es_es: Ver los ejemplos en L<perlipc/"Sockets: Comunicación Cliente/Servidor">.

source: Those examples also illustrate that you should not try to use C<pack>/C<unpack> as a substitute for the L<Encode> module.
es_es: Estos ejemplos también ilustran que no debería tratar de usar C<pack>/C<unpack> como un sustituto del módulo L<Encode>.

source: You can specify a character class, by enclosing a list of characters in C<[]>, which will match any character from the list.
es_es: Puede especificar una clase de caracteres, encerrando una lista de caracteres en C<[]>, que coincidirá con cualquier carácter de la lista.

source: threadsafe DynaLoader, re, Opcode, File::Glob, and B
es_es: DynaLoader, re, Opcode, File::Glob, y B, compatibles con threads

source: This keyword is available only when the C<"say"> feature is enabled; see L<feature>.
es_es: Esta palabra clave sólo está disponible cuando la característica C<"say"> está habilitada; vea L<feature>.

source: Note that when C<use integer> is in scope, "%" gives you direct access to the modulo operator as implemented by your C compiler.
es_es: Tenga en cuenta que cuando C<use integer> está en su ámbito, "%" le da acceso directo al operador módulo, implementado por su compilador de C.

source: See L<Encode> and L<perlunicode>.
es_es: Ver L<Encode> y L<perlunicode>.

source: For example, here is a loop that inserts index producing entries before any line containing a certain pattern:
es_es: Por ejemplo, aquí hay un bucle que inserta índices de entradas antes de cualquier línea que contenga un cierto patrón:

source: Version 5 of Perl changed the semantics of C<$[>: files that don't set the value of C<$[> no longer need to worry about whether another file changed its value.
es_es: La versión 5 de Perl cambió la semántica de C<$[>: los archivos que no asignen un valor a C<$[> no necesitan preocuparse nunca más de si otro archivo ha cambiado su valor.

source: or programmatically via the C<Config> module:
es_es: o programáticamente vía el módulo C<Config>:

source: If C<use locale> is in effect, the C<\U> will use locale rules; if C<use feature 'unicode_strings'> is in effect, it will use Unicode rules, etc.
es_es: Si C<use locale> está en vigor, el C<\U> usará las reglas regionales; si C<use feature 'unicode_strings'> está en vigor, usará las reglas Unicode, etc.

source: a # non-zero
es_es: a # no cero

source: It is the program's responsibility to C<close DATA> when it is done reading from it.
es_es: Es responsabilidad del programa hacer C<close DATA> cuando se termine la lectura del mismo.

source: print << "EOF"; # same as above
es_es: print << "EOF"; # lo mismo que el anterior

source: In fact numbers stored in the native integer format may be stored either in the signed native form, or in the unsigned native form.
es_es: De hecho, los números almacenados en formato de entero nativo se pueden almacenar en forma nativa con signo o sin signo.

source: As part of the C<Test::Harness> 2.x to 3.x upgrade, the experimental C<Test::Harness::Straps> module has been removed.
es_es: Como parte de la actualización de C<Test::Harness> 2.x a la 3.x, se ha eliminado el módulo experimental C<Test::Harness::Straps>.

source: The C<require> makes sure the module is loaded into memory if it hasn't been yet.
es_es: El C<require> se asegura que el módulo esté cargado en memoria, si todavía no lo está.

source: "aa" =~ /${a}/; # True
es_es: "aa" =~ /${a}/; # Verdadero

source: For example, this program
es_es: Por ejemplo, este programa

source: You really should build the whole distribution on the machine it will eventually live on, and then type C<make install>.
es_es: Es muy recomendable compilar toda la distribución en el equipo en el que se va a instalar y después ejecutar el comando C<make install>.

source: Behavior of this function varies wildly depending on your system implementation.
es_es: El comportamiento de esta función varía enormemente dependiendo de la implementación de su sistema.

source: The C<POSIX::getattr> function can do this more portably on systems purporting POSIX compliance.
es_es: La función C<POSIX::getattr> puede hacer esto de forma más portable en sistemas compatibles con POSIX.

source: make h2ph understand constants like 1234L and 5678LL
es_es: make h2ph entiende las constantes como 1234L y 5678LL

source: my @numbers = (23, 42, 69);
es_es: my @numeros = (23, 42, 69);

source: =head2 C code
es_es: =head2 Código C

source: Perl is available for most operating systems, including virtually all Unix-like platforms.
es_es: Perl está disponible para la mayoría de los sistemas operativos (incluidas prácticamente todas las plataformas Unix).

source: See also L</oct>, if all you have is a string.
es_es: Ver también L</oct>, si todo lo que tiene es una cadena.

source: As you can see, it's getting a bit complicated.
es_es: Como puede ver, se está haciendo un poco complicado.

source: If you wish to retain compatibility with the older behavior, set PERL5SHELL in your environment to C<cmd /x/c>.
es_es: Si desea mantener la compatibilidad con el antiguo comportamiento, establezca PERL5SHELL en su entorno a C<cmd /x/c>.

source: The following blocks are more or less equivalent:
es_es: Los siguientes bloques son, más o menos, equivalentes:

source: would use C<$a> for the width and precision, and C<$b> as the value to format.
es_es: usaría C<$a> para el ancho y precisión, y C<$b> como el valor a formatear.

source: However, interpolating a regex into a larger regex would ignore the original compilation in favor of whatever was in effect at the time of the second compilation.
es_es: Sin embargo, la interpolación de una expresión regular en una expresión regular más grande ignoraría la compilación original en favor de lo que estaba en vigor en el momento de la segunda compilación.

source: In a context not requiring a list value, the value of what appears to be a list literal is simply the value of the final element, as with the C comma operator.
es_es: En un contexto que no requiera una lista de valores, el valor de lo que parece ser una lista literal es, simplemente, el valor del último elemento, como ocurre con el operador coma en C.

source: In list context, returns a list of lines (however you've defined lines with $/ or $INPUT_RECORD_SEPARATOR), or an empty list if the command failed.
es_es: En contexto de lista, devuelve una lista de líneas (según haya definido líneas con $/ o $INPUT_RECORD_SEPARATOR), o una lista vacía si el comando ha fallado.

source: The proper way to get a 4-digit year is simply:
es_es: La forma apropiada para obtener un año con los 4 dígitos es simplemente:

source: In some platforms (like Linux) that use glibc the minimum memory footprint of one ithread has been reduced by several hundred kilobytes.
es_es: En algunas plataformas (como Linux) que usan glibc, el consumo mínimo de memoria de un ithread se ha reducido en varios cientos de kilobytes.

source: Perl will now use the C library calls C<unsetenv> and C<clearenv> if present to delete keys from C<%ENV> and delete C<%ENV> entirely, thanks to a patch from Alan Burlison.
es_es: Perl ahora utilizará las funciones de la biblioteca C C<unsetenv> y C<clearenv> si se indica que se deben borrar claves de C<%ENV> o si se elimina C<%ENV> por completo, gracias a un parche de Alan Burlison.

source: except that Module I<must> be a bareword.
es_es: excepto que el módulo I<debe> ser una palabra simple.

source: This function behaves the same way under various pragma, such as in a locale, as L</lc> does.
es_es: Esta función se comporta de la misma manera bajo varios I<pragma>, como por ejemplo en una configuración regional, como lo hace L</lc>.

source: # my $tcp = IPPROTO_TCP; # Alternative
es_es: # my $tcp = IPPROTO_TCP; # Alternativa

source: If there is no filehandle (previous item), then this subroutine is expected to generate one line of source code per call, writing the line into C<$_> and returning 1, then finally at end of file returning 0.
es_es: Si no hay un identificador de archivo (punto anterior), entonces de esta subrutina se espera que genere una línea de código fuente por llamada, escribiendo la línea en C<$_> y devolviendo 1, para luego, finalmente, devolver un 0 al final del archivo.

source: next LINE if /^#/; # discard comments
es_es: next LINEA if /^#/; # descartar comentarios

source: If you are using ACLs, there is a pragma called C<filetest> that may produce more accurate results than the bare stat() mode bits.
es_es: Si está usando ACL, hay un pragma llamado C<filetest> que puede producir resultados más precisos que los simples bits de modo de stat().

source: As more recent versions of autoconf require flock() support, I wrote a flock() emulation (flock_server) and released it on BeBits:
es_es: Como las versiones más recientes de autoconf requieren soporte de flock(), he escrito una emulación de flock() (flock_server) y la publiqué en BeBits:

source: This zero-width assertion evaluates any embedded Perl code.
es_es: Esta aserción de ancho cero evalúa cualquier código Perl empotrado en él.

source: (at least in platforms of ASCII progeny) Perl 5.8.1 restored the more natural interpretation
es_es: (al menos en las plataformas de la progenie ASCII). Perl 5.8.1 restauró la interpretación más natural

source: perl5136delta Perl changes in version 5.13.6
es_es: perl5136delta Cambios en la versión 5.13.6

source: Similar to C<(??{ code })> except it does not involve compiling any code, instead it treats the contents of a capture group as an independent pattern that must match at the current position.
es_es: Similar a C<(??{ código })> excepto que no incluye la compilación de ningún código; en vez de eso trata a los contenidos de un grupo de captura como un patrón independiente que debe coincidir en la posición actual.

source: I have built and tested Perl 5.8.6 and 5.9.1 under BeOS R5 x86 net server.
es_es: He construido y probado Perl 5.8.6 y 5.9.1 bajo BeOS R5 x86 net server.

source: perl5110delta Perl changes in version 5.11.0
es_es: perl5110delta Cambios en la versión 5.11.0

source: print "Yow!";
es_es: print "¡Caramba!";

source: So C<< ((?>a*)|(?>b*))ar >> will still match "bar".
es_es: Por tanto C<< ((?>a*)|(?>b*))ar >> aún lo haría con "bar".

source: There were a number of inconsistencies (bugs) with the C</d> modifier, where Unicode rules would be used when inappropriate, and vice versa.
es_es: Hubo una serie de inconsistencias (errores) con el modificador C</d>, donde reglas Unicode serían usadas de forma inadecuada, y viceversa.

source: =item system LIST
es_es: =item system LISTA

source: The equivalent numeric version should be used instead.
es_es: Se debe usar en su lugar la versión equivalente numérica.

source: =item seek FILEHANDLE,POSITION,WHENCE X<seek> X<fseek> X<filehandle, position>
es_es: =item seek IDENTIFICADOR_ARCHIVO,POSICIÓN,DÓNDE X<seek> X<fseek> X<filehandle, position> X<identificador de archivo, posición>

source: (This start line assumes you have the B<env> program.
es_es: (En esta línea se supone que dispone del programa B<env>.

source: $n = 0x1234; # hexadecimal integer
es_es: $n = 0x1234; # entero hexadecimal

source: arbitrarily nested data structures and anonymous functions
es_es: estructuras de datos anidadas de profundidad arbitraria y funciones anónimas

source: =item ?PATTERN?msixpodualgc
es_es: =item ?PATRÓN?msixpodualgc

source: Strings that would cause integer overflow trigger a warning.
es_es: Strings que podrían causar desbordamiento de enteros lanzará un aviso.

source: =item C<(?(condition)yes-pattern|no-pattern)>
es_es: =item C<(?(condición)patrón-sí|patrón-no)>

source: \h [3] Horizontal whitespace
es_es: \h [3] Espacio en blanco horizontal

source: my $byte_count = length $body;
es_es: my $numero_bytes = length $cuerpo_texto;

source: Equivalent to C<< \g{NAME} >>.
es_es: Equivalente a C<< \g{NOMBRE} >>.

source: because the second way hides the main point of the statement in a modifier.
es_es: porque la segunda forma esconde el objetivo principal de la instrucción dentro de un modificador.

source: =item no MODULE LIST
es_es: =item no MÓDULO LISTA

source: Not all fields are supported on all filesystem types.
es_es: No todos los campos están soportados por todos los sistemas de archivos.

source: Starting from Perl 5.8.1, the above B<will> cause an error to be raised.
es_es: A partir de Perl 5.8.1, lo anterior B<provocará> un error.

source: Occasionally, you can't use just a C</g> to get all the changes to occur that you might want.
es_es: De vez en cuando, no solo se puede utilizar un C</g> para obtener todos los cambios posibles.

source: If you wanted just to append to a row, you'd have to do something a bit funnier looking:
es_es: Si sólo quiere añadir a una fila, tendrá que hacer algo un poco más divertido:

source: If you have a question, you can be sure someone has already asked the same question at some point on c.l.p.m.
es_es: Si quiere preguntar algo, puede estar seguro de que alguien ya ha tenido esa duda antes y ha pedido ayuda en c.l.p.m.

source: For the availability and the exact meaning of these fields in your system, please consult getpwnam(3) and your system's F<pwd.h> file.
es_es: Para la disponibilidad y el significado exacto de estos campos, en su sistema, por favor consulte getpwnam(3) y su archivo F<pwd.h>.

source: The actual location where C<\G> will match can also be influenced by using C<pos()> as an lvalue: see L<perlfunc/pos>.
es_es: La ubicación actual donde C<\G> coincidirá también puede modificarse usando C<pos()> como un I<ivalor>: vea L<perlfunc/pos>.

source: The point of the function is to "seed" the C<rand> function so that C<rand> can produce a different sequence each time you run your program.
es_es: La misión de la función es "alimentar" a la función C<rand> para que C<rand> pueda producir una secuencia diferente cada vez que ejecute su programa.

source: If multiple groups have the same name then it refers to the leftmost defined group in the current match.
es_es: Si varios grupos tienen el mismo nombre entonces se refiere al grupo más a la izquierda de la coincidencia actual.

source: Similarly, the terminator of C<(?{...})> is found using the same rules as for finding the terminator of a C<{}>-delimited construct.
es_es: Del mismo modo, el terminador de C<(?{...})> es encontrado usando las mismas reglas como para encontrar el terminador de una construcción delimitada por C<{}>.

source: C<pos> is only updated on a C</g> match.
es_es: C<pos> sólo es actualizado en una coincidencia C</g>.

source: This check is the regex equivalent of
es_es: Esto comprueba si la regex equivale a

source: This should build miniperl and then fail when it tries to run it.
es_es: Esto debería construir miniperl y luego fallar cuando trate de ejecutarlo.

source: $fh = newopen('/etc/passwd');
es_es: $fh = nuevoopen('/etc/passwd');

source: =item Finding the end
es_es: =item Encontrando el final

source: The LIMIT parameter can be used to split a line partially
es_es: El parámetro LÍMITE puede usarse para dividir una línea de forma parcial

source: For more information on writing subroutines, see L<perlsub>.
es_es: Para obtener más información sobre cómo escribir subrutinas, consulte L<perlsub>.

source: If C<LABEL> is omitted, restarts the program from the top.
es_es: Si se omite C<ETIQUETA>, reinicia el programa desde el principio.

source: The UTF-7 encoding has been added (making Encode feature-complete with Unicode::String).
es_es: La codificación UTF-7 ha sido añadida (haciendo que Encode tenga las características completas con Unicode::String).

source: If the format specification uses C<*> to require additional arguments, these are consumed from the argument list in the order they appear in the format specification I<before> the value to format.
es_es: Si la especificación de formato utiliza C<*> para exigir argumentos adicionales, estos se consumen de la lista de argumentos en el orden en que aparecen en la especificación del formato I<antes> del valor a dar formato.

source: General examples:
es_es: Ejemplos generales:

source: ... than to have a long list of unnamed parameters like this:
es_es: ... que tener una larga lista de parámetros sin nombre, como este:

source: Fixes for certain bugs in C<make> and C<emake>
es_es: Correcciones de errores determinados en C<make> y C<emake>

source: It is written in the POD format (see pod/perlpod.pod) which is specifically designed to be readable as is.
es_es: Está escrito en formato POD (ver pod/perlpod.pod) que está específicamente diseñado para ser legible de forma sencilla.

# $search .= "++$seen{$ARGV} if /\b$word\b/; ";
source: $search .= "++\$seen{\$ARGV} if /\\b$word\\b/;\n";
es_es: $buscar .= "++\$visto{\$ARGV} if /\\b$palabra\\b/;\n";

source: In Perl you can backtrack into a recursed group, in PCRE and Python the recursed into group is treated as atomic.
es_es: En Perl se puede dar marcha atrás en un grupo recursivo, en PCRE y lenguajes de programación Python el grupo recursivo es tratado de forma atómica.

source: If you omit the LIST, C<$_> is used; to use FILEHANDLE without a LIST, you must use a real filehandle like C<FH>, not an indirect one like C<$fh>.
es_es: Si omite la LISTA, se usará C<$_>; para usar un IDENTIFICADOR_ARCHIVO sin una LISTA, debe usar un identificador de archivo real, como C<FH>, no uno indirecto como C<$fh>.

source: PRINTF this, format, LIST
es_es: PRINTF este, formato, LISTA

source: There is no double interpolation in Perl, so the C<$100> is left as is.
es_es: No hay doble interpolación en Perl, por lo que el C<$100> se deja tal como está.

source: -t Filehandle is opened to a tty.
es_es: -t El identificador está abierto a una tty.

source: The exact numbers depend on the Perl configuration and on the operating system platform.
es_es: El número exacto dependerá de la configuración de Perl y de la plataforma del sistema operativo.

source: C<is_deeply()> no longer fails to work for many cases
es_es: C<is_deeply()> ya no falla en la mayoría de los casos

source: The C<last> command immediately exits the loop in question.
es_es: El comando C<last> sale inmediatamente del bucle en cuestión.
